---
kind: type
id: T:Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType
source: html/edb39897-9424-1a7d-e12c-1c3ad5d41296.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType

ConceptualConstructionType values for Windows and Skylights

## Syntax (C#)
```csharp
public enum ConceptualConstructionWindowSkylightType
```